# -*- coding: utf-8 -*-
BEGIN_BUTTON = '✅Начать'

START_REGISTRATION_BUTTON = '✅ Перейти к заполнению'

GENDER_MALE = ['Я мужчина, ищу женщину', 'M']

GENDER_FEMALE = ['Я женщина, ищу мужчину', 'Ж']

OTHER_GENDER = 'Другое'

MOSCOW = '🏢 Москва'

SAINT_PETERSBURG = '🏬 Санкт-Петербург'

SAMARA = '🏤 Самара'

OTHER_CITY = '🌆 Другой город'

NOMAD = '🏇 Я Кочевник'

SUBSCRIBE = '✅ Подписаться на наш канал'

RESTART_REGISTRATION = '🔁 Начать регистрацию с начала'

NEXT_STEP = 'Следующий шаг➡️'

SERIOUS_REL = '💙 Серьёзные отношения'

FAMILY = '💜 Создание семьи'

FRIENDS = 'Дружба и общение'

FREE_USE = 'Встречи без обязательств'

STUCK_ANSWER = 'Затрудняюсь ответить'

PHOTO_RECOMENDATION = '🔠 Рекомендации по загрузке'

UPLOAD_PHOTO = '⬆️ Загрузить фото'

YES = '✅Да'

NO = '❌Нет'

WATCH_PROFILE = '🧾Посмотреть профиль'

NEXT_STEP = 'Следующий шаг➡️'

CHECK_EXTRA_PHOTOS = '🔢 Проверить фотографии'
