# -*- coding: utf-8 -*-
BEGIN_BUTTON = '✅Начать'

START_REGISTRATION_BUTTON = '✅ Перейти к заполнению'

GENDER_MALE = ['Я мужчина, ищу женщину', 'M']

GENDER_FEMALE = ['Я женщина, ищу мужчину', 'Ж']

OTHER_GENDER = 'Другое'

MOSCOW = '🏢 Москва'

SAINT_PETERSBURG = '🏬 Санкт-Петербург'

SAMARA = '🏤 Самара'

OTHER_CITY = '🌆 Другой город'

NOMAD = '🏇 Я Кочевник'

SUBSCRIBE = '✅ Подписаться на наш канал'

RESTART_REGISTRATION = '🔁 Начать регистрацию с начала'

NEXT_STEP = 'Следующий шаг➡️'

SERIOUS_REL = '💙 Серьёзные отношения'

FAMILY = '💜 Создание семьи'

FRIENDS = 'Дружба и общение'

FREE_USE = 'Встречи без обязательств'

STUCK_ANSWER = 'Затрудняюсь ответить'

PHOTO_RECOMENDATION = '🔠 Рекомендации по загрузке'

UPLOAD_PHOTO = '⬆️ Загрузить фото'

YES = '✅Да'

NO = '❌Нет'

WATCH_PROFILE = '🧾Посмотреть профиль'

CHECK_EXTRA_PHOTOS = '🔢 Проверить фотографии'

LETS_GO = '♻️ ПОЕХАЛИ ♻️'

BACK = '⬅️Назад'

FORWARD = 'Вперед➡️'

BEGIN_REGISTRATION = '✅Начать регистрацию'

INFO_ABOUT_PROJECT = 'ℹ️ Читать о проекте'

BACK_TO_THE_MENU = '🔁Обратно в меню'

ABOUT_PROJECT = '🧾О проекте'

UNIQ = '🔮Уникальность'

ABOUT_IMPRINTING = '💡Что такое импринтинг'

USER_AGREEMENT = '📝Пользовательское соглашение'

FAQ = '❓Частые вопросы'

CONCEPT = '📊Концепция сервиса'

PHOTO = '🖼Фото пользователей'

FIND = '💑Поиск пары и оплата'

INVESTORS = '📈Партнеры и инвесторы'

JOURNALISTS = '📝Для журналистов'

SUPER_LIKE = '💖 Очень нравится'

LIKE = '❤️ Нравится'

UNLIKE = '✖️ Не нравится'

ANSWER_STUDY = '''Фото %s из 30.
У вас осталось:
- %s оценок «Нравится»
- %s оценок «Очень нравится»'''

ANSWER_NO_LIKES = '⚠️ У вас больше не осталось отметок «Нравится». Выберите другой вариант.'

ANSWER_NO_SUPERLIKES = '⚠️ У вас больше не осталось отметок «Очень нравится». Выберите другой вариант.'

SUBSC_BUTTON = '💲 Подписки'

HELP_BUTTON = '👁‍🗨 Написать в поддержку'

PAUSE = '⏸ Поставить на паузу'

TELEGRAM_BUTTON = '🛂Мы в Телеграм'

DENY = '🔴 Отменить подписку'

GET_SUBSCRIBE = '💵 Оформить подписку'

UNPAUSE = '▶️ Снять с паузы'

WANNA_MEET = '✅Хочу встретиться!'

SEND_PHOTO = '📸Отправить фото'

SEND_REQUEST = '🛑Отправить жалобу'

END_DIALOG = '❌Завершить диалог'

LOOK = 'Не понравилась внешность'

COMUNICATION = 'Не понравилось общение'

IGNORE = 'Собеседник не отвечает'

OTHER = 'Другое'

LIKE_LOOK = 'Понравился/понравилась'

OK_MEET = 'Состоялась'

NOT_OK_MEET = 'Не состоялась по причине'

MEETING_BEHAVIOR = 'Не понравилось поведение'

MEETING_PLACE = 'Не понравилось место'

LIKE_MEETING = "Очень понравилось"

NEUTRAL_MEETING = "Ничего особенного"

DONT_LIKE_MEETING = "Не понравилось"

MAIN_MENU = "Показать главное меню"
