# -*- coding: utf-8 -*-
WELCOME = '👋 Добро пожаловать!\n\nСоздайте свой профиль и пройдите небольшой тест, который поможет роботу понять,\
         кто вам действительно подходит.\n\nРобот будет еженедельно подбирать для вас наиболее подходящую пару, с которой вы сможете пообщаться, чтобы лучше узнать друг друга!\nНачнем знакомство?'

ABOUT = 'Система знакомств «Unison» основана на специально разработанном алгоритме, имеющем научную основу. \
     Импринтинг или запечатление — это неосознанная привязанность к конкретным образам из подсознания. \
     \nПоиск начнётся сразу после регистрации и будет повторяться каждую неделю. Это время даётся вам \
      для знакомства и общения с кандидатами.'

UNIQUENESS = 'Наверняка вы обращали внимание, что во всех счастливых историях любви партнёры говорят о знакомстве примерно одинаково:\
    \n\n«Непонятное очарование этого человека сразу захватило меня». Наши психологи совместно с программистами проанализировали \
    более 5 000 самых успешных и выдающихся пар, и выявили те неуловимые свойства, которые проявлялись в момент знакомства. \
    \n\nНаша специально обученная нейросеть ©Unison проанализирует внешность и поведенческие параметры по более, чем 100 свойствам,\
    и, исходя из полученных данных и ваших вкусовых предпочтений, сможет подобрать вам лучшую пару.'

IMPRINT = 'Импринтинг (от английского «imprinting» — «впечатывание») — это особая форма обучения, во время которой информация\
    запоминается мгновенно и сохраняется на всю жизнь. Она буквально впечатывается в мозг и в дальнейшем проявляется на уровне подсознания.\n\nПоэтому особенности поведения, зафиксированные в процессе импринтинга, сложно контролировать и\
    практически невозможно изменить. Информация, запомненная посредством данного механизма, не требует позитивного подкрепления (не нужно ничего повторять — она и так хранится всю жизнь).'

CONCEPT = """❓ Это те знакомства, которые не знакомят, а влюбляют?

✅ Именно так. Наша система построена на научном методе выбора партнёра, это приводит к возникновению любви. Кроме того, мы работаем на результат, а не на повторение дофаминовых циклов, которые вызывают у людей зависимость и приводят в приложения снова и снова.

Мы работаем над формированием правильно сбалансированной пары, в которой будет любовь и согласие на многие годы.

❓ Как работает система?

✅ Основа работы — определение наиболее благоприятного фенотипа с использованием расшифровки импринтинга. Говоря простым языком, мы определяем образ наиболее подходящего человека для каждого пользователя и даём возможность этим людям встретиться в реальной жизни.

❓ Чем отличается Unison от других знакомств?

✅ Популярные системы знакомств, основанные на визуальном фильтре (Тиндер-подобные системы) имеют крайне низкую объективную оценку эффективности знакомств — при кажущейся простоте получения знакомств эти системы не выполняют своих функций.

Мы же, наоборот, стремимся работать именно для достижения цели — знакомство с полностью подходящим человеком с целью начать отношения.
"""

PHOTO = """❓ Кто увидит мои фото?

✅ В системе есть три типа фото, которые загружает сам пользователь. 

Первый тип — собственное фото профиля. Это фото будет видеть только потенциальный партнёр, которого мы подберём для вас. 

Второй тип — собственные «селфи» для формирования датасета. Эти фото не видит никто, кроме нашего алгоритма.

Третий тип — фото наиболее привлекательных для пользователя людей. Эти фото не видит также никто, кроме нашего алгоритма. 

То есть только одно фото увидит ваш потенциальный партнёр — фото профиля.

❓ Как будут использованы мои фотографии?

✅ Фото используются для формирования датасета. Система машинного обучения (искусственный интеллект) сравнивает личный датасет пользователя с датасетами других пользователей и находит наиболее подходящие совпадения.

❓ Вы просите загрузить фото тех, кто мне нравится. Зачем это надо и как они будут использованы?

✅ Нам необходимо понять динамику изменения фенотипических особенностей благоприятных образов. Если таких фотографий нет, результат поиска будет значительно хуже."""

FIND = """❓ Вы разрушаете браки, потому что предоставляете пользователям лучшие варианты пары, чем они имеют сейчас. Многие могут поверить в чудодейственность вашей системы.

✅ Разрушение несчастливого брака — скорее благо, чем трагедия. Жизнь довольно короткая, чтобы жить в травмирующих и токсичных отношениях. Позвольте себе быть счастливыми и узнать, как это на самом деле — любить и быть любимым.

❓ Сколько и за что надо платить?

✅ На данный момент можно платить за платную подписку, которая предоставляет неограниченные возможности поиска и более широкий выбор партнёров. Актуальную стоимость можно узнать только в момент оплаты. От подписки можно в любой момент отказаться. Все цены подобраны с учётом того, чтобы платный сервис мог себе позволить любой пользователь.

В ближайшее время будут запущены другие полезные платные сервисы.

❓ Сколько нужно времени, чтобы найти идеальную пару для меня?

✅ Это зависит от наполненности базы в том регионе, где вы знакомитесь и от простого везения. В любом случае, при помощи нашего сервиса такая пара должна найтись гораздо быстрее, чем при помощи традиционных сервисов знакомств (Тиндер-модель и другие).
"""

INVESTORS = """❓ Я инвестор и хотел бы инвестировать.

✅ Свяжитесь напрямую с создателями системы Максимом Щегловым и Сергеем Сигитовым по адресу hello@unison.dating. Мы сообщим вам актуальную потребность в инвестициях и предпочтительные условия. Мы рассматриваем частные инвестиции и коммерческие фонды, специализирующиеся на b2с модели и прямой монетизации. 

По этому адресу нельзя получить помощь или сообщить о возврате денег. Все обращения подобной тематики необходимо отправлять в Службу поддержки.

❓ Как я могу связаться, чтобы получить франшизу или лицензию на использование системы в другой стране?

✅ Мы можем сотрудничать с локальными партнёрами в сфере интернет-маркетинга, пиара и различных форм продвижения интернет-проектов. Например, мы можем предоставлять приоритетное право на продвижение системы с помощью крупных локальных партнёров или приобрести возможность установки системы на телефоны производителей в пакете предустановленных программ. Пришлите ваше предложение по адресу hello@unison.dating
"""

JOURNALISTS = """❓ Я журналист и хочу попробовать систему, прежде чем писать про Unison. Что мне надо учесть?

✅ Так как у вас нет мотивации познакомиться, вы можете совершать много ошибок в процессе регистрации, и, скорее всего, будете заблокированы ранее, чем достигните первого результата.

Пожалуйста, обратите внимание, что для получения полного представления о системе вы должны быть твёрдо уверены, что хотите создать семью или начать отношения. Мы можем провести демонстрацию системы и предоставить данные статистики, если вы обратитесь по электронной почте hello@unison.dating
"""

USER_AGREEMENT1 ="""Пользовательское соглашение на использование сервиса «UNISON».
Краткое изложение этого документа. 

Если у вас совсем нет времени, мы рекомендуем ознакомиться хотя бы с этим пунктом. Здесь в нескольких тезисах собрана вся необходимая информация о соглашении и правилах использования сервиса. 

- Сервис предназначен для знакомств;
- Если начинаете использовать сервис, то принимаете все правила сервиса;
- Мы используем ваши персональные данные очень аккуратно;
- Персональные данные нужны для работы системы и лучшего поиска потенциального партнёра;
- Мы — единственные в мире используем метод импринтинга в дейтинге (знакомствах);
- Импринтинг — это эффект неосознанного запечатления;
- Наше ноу-хау — система расшифровки импринтинга;
- Мы используем фотографии пользователей, чтобы формировать датасет из фото;
- На основе сопоставлений датасетов по технологии (с) «Unison» мы ищем потенциальных партнёров каждому пользователю сервиса;
- Поиск происходит автоматически и сами сотрудники сервиса не могут влиять на результат поиска;
- Сервис снимает с себя ответственность за адекватность пользователей, соответствие фотографиям и поведение людей, использующих систему;
- Тем не менее, мы прилагаем все усилия, чтобы в сервисе были только доброжелательные и адекватные пользователи, с единственной целью — серьёзные отношения;
- Сервис предоставляет информацию властям в рамках действующего законодательства;
- Оплата в сервисе взимается за предоставление первоочередной возможности поиска потенциальных партнёров и за другие услуги;
- Мы относимся с особым расположением ко всем людям с «нетрадиционной» ориентацией, но работаем в данный момент только для гетеросексуальных пар.

Об этом соглашении.

Этот длинный текст — свод правил, которые мы, компания «UNISON», установили для себя для выстраивания корректных отношений с пользователями сервиса. Мы постарались предусмотреть все случаи разногласий и отказаться от любой ответственности, которая может возникнуть в процессе использования сервиса. 

Мы используем следующие названия: сервис «UNISON», «Unison dating», «Unison bot», технология подбора партнёра (с) «Unison». Это не все наименования, но наиболее часто используемые.

Что такое оферта.

Мы, как компания, действуем на основе оферты — это специальный вид договора, который не требует подписания, чтобы считаться рабочим документом. Для того, чтобы принять этот договор на изложенных ниже условиях, достаточно просто начать использовать наш сервис.

Перед использованием сервиса «UNISON» необходимо ознакомиться с условиями настоящего пользовательского соглашения. Часто многие пользователи в других сервисах просто ставят галочку «принимаю», не читая текст. Вы правы, прочитать весь текст невозможно, но мы настаиваем, чтобы вы сделали это, так как этого требует закон.')"""

USER_AGREEMENT2 = """Ваше согласие.

Если вы начинаете использовать сервис — значит признаёте согласие с тем, что: 
- До начала использования ознакомились с условиями настоящего пользовательского соглашения в полном объёме и приняли все условия без каких-либо исключений;
- Настоящее пользовательское соглашение может быть изменено Компанией без какого-либо уведомления. Новая редакция пользовательского соглашения вступает в силу с момента её размещения на Сайте и в боте, если иное не предусмотрено новой редакцией соглашения.

В случае несогласия с условиями настоящего пользовательского соглашения пользователю следует прекратить использование сервиса «UNISON».

Как работает система?

UNISON — это система знакомств, то есть сервис предназначен только для знакомств с целью создания семьи и отношений. Все другие способы использования считаются невалидными и пользователи-нарушители  могут быть заблокированы.

Как мы используем ваши фотографии и личные данные?

Для того, чтобы находить лучшего партнёра, мы составляем несколько датасетов. Датасеты — это блоки информации, которую мы обрабатываем собственными алгоритмами. Для таких датасетов необходимо взять несколько фото человека и несколько фото симпатичных ему людей. 

По различным признакам загружаемых фото (размер, дата съёмки, на что снято, редактировалось фото или нет и т.д.) мы определяем степень ценности фото. Используя информацию из открытых источников, мы ищем дубли, тональность и окружение для этих фото. 

Мы не можем вмешиваться в содержимое датасетов и менять алгоритм. Наша задача — перенести без потерь научный метод на практику.

Насколько безопасно предоставлять данные компании «UNISON»?

Предоставлять данные точно так же безопасно, как и в любой другой сервис в России. Мы не используем данные никак, кроме как в описанных алгоритмах.

Права на используемые данные. 

Мы предоставляем право использования наших систем любым пользователям согласно простой (неисключительной) лицензии. То есть вы можете использовать систему как физическое лицо в любой стране, где возможен доступ в систему (и где явно не запрещено такое использование). 

Данные, которыми обладают пользователи и которые пользователи загружают в систему, предоставляются для совместного доступа. Мы обязуемся не нарушать приватность и не публиковать ничего, что могло бы идентифицировать пользователей. Кроме того, пользователь обязуется принимать должные меры для обеспечения безопасности собственных данных (в том числе, персональных данных).

Платные сервисы. 

Для того, чтобы развивать сервис, мы сделали некоторые функционалы платными. Мы получаем оплату и инвестируем её в развитие сервиса. Мы стараемся держать уровень оплаты на таком уровне, чтобы стоимость была доступной для всех. 

Основной платный сервис — предоставление пакета преимущественного права поиска партнёров. Для тех, кто оплатил сервис, доступны расширенные функции системы. Оплата взимается еженедельно или ежемесячно, путём списания с карты, подключенной к оплате.

Для того, чтобы отключить оплату, необходимо изменить настройки системы в платёжной системе, подключенной к тому интерфейсу, который вы используете (например, Телеграмм-бот).

Другие платные сервисы могут быть основаны на других функционалах системы, возможно, не существующие в данный момент, когда вы читаете это соглашение. Они могут иметь также другую схему оплаты, например, единоразовую."""

USER_AGREEMENT3 = """Ответственность. 

Мы отказываемся от какой-либо ответственности (все так делают, просто мы говорим об этом прямо). Обычно говорят, что сервис предоставляется на условиях «как есть» (as is).

Мы не не предоставляем никаких гарантий в отношении безошибочной и бесперебойной работы, соответствия сервиса конкретным целям и ожиданиям пользователя, не гарантируем достоверность, точность, полноту и своевременность предоставляемых сервисом данных, а также не предоставляем никаких иных гарантий, указанных или не указанных в этом соглашении. 

Мы также не несём ответственность за последствия использования или неиспользования сервиса. Однако предупреждаем, что «Под лежачий камень вода не течёт» и «Человек сам кузнец своего счастья». 

Что нельзя. 

Просим не загружать, не хранить, не публиковать, не распространять любую информацию, которая может быть воспринята, как «токсичная», опасная, дискредитирующая, нарушающая неприкосновенность третьих лиц. 

Также нельзя размещать: 
- Рекламу и пропаганду (в том числе рекламу вакансий, образовательных программ и т.д.);
- Что-то непристойное;
- То, что нарушает требования закона.

Актуальность соглашения. 

Действие этого соглашения распространяется на всё, что было ранее, если обновление или новая версия не сопровождается иным соглашением. Это соглашение может быть изменено в любой момент без уведомлений. 

Редакция от 07 октября 2021 года."""

LETS_GO = "Поиск начнётся сразу после регистрации и будет повторяться каждую неделю. Это время даётся вам для знакомства и общения с кандидатами."

REGISTRATION_RULES = """В процессе регистрации будет сформирован ваш профиль и взяты данные для поиска. 

Отнеситесь к процессу регистрации ответственно. 

Регистрация будет проходить в три этапа: 
➡️ Формирование профиля и личного датасета.
➡️ Тест на определение личных предпочтений фенотипа партнёра. 
➡️ Дополнение датасета важными данными для улучшения поиска.

Вся регистрация займёт не больше 3-5 минут."""

NAME = """Представьтесь, пожалуйста!

Напишите своё имя, оно будет указано в вашем профиле и его будут видеть другие пользователи системы.

Не используйте прозвища и никнеймы, это может вызвать негативное впечатление при первом знакомстве."""

UNDER_CONSTRUCTION = """⚠️ К сожалению, сейчас мы не можем помочь вам с поиском партнёра, так как работаем только для поиска серьёзных отношений.

Сервис активно развивается, и, возможно, скоро вы найдёте у нас то, что желаете. Мы будем рады получить от вас обратную связь с любыми предложениями и замечаниями.

Пожалуйста, подпишитесь на наш канал! Мы обязательно сообщим, когда запустим новые города и новые функции."""

BIRTHDATE = """📆 Укажите дату рождения, в формате ДД.ММ.ГГГГ.

⚠️ Эта информация не будет отображаться в профиле. Она необходима для подтверждения совершеннолетия, идентификации пользователя и подбора оптимальных кандидатов для знакомства."""

WRONG_BIRTHDATE = """🔴 Неправильный формат даты. 

Введите ещё раз в правильном формате ДД.ММ.ГГГГ. Например, 28.03.1989.
"""

CITY_CHOOSE = """🌆 Выберите из списка ваш город.

Система автоматически будет подбирать ближайших к вам кандидатов.
"""

MODERATION = """✅ Ваши данные загружены на сервер и проходят модерацию.

Для окончания регистрации вам необходимо загрузить ваши фотографии.

📸 Загрузите основную фотографию вашего профиля.

Можно загружать:
- Качественные и чёткие снимки, где хорошо видно ваше лицо; 
- Подходят «селфи» или портретные фотографии.

Нельзя загружать: 
- Фото в солнцезащитных очках;
- Слишком мелкие фото;
- Фотографии с посторонними людьми;
- Любые другие картинки и изображения.

⚠️ Помните, все фотографии модерируются.
"""

UPLOAD_PHOTO = """Загрузите вашу основную фотографию.

⚠️ Загружайте ОДНУ фотографию за один раз."""

PHOTO_RECOMENDATION = """Загружайте фото по одному, в режиме «фото», с компрессией (а не в режиме «документов»). Дождитесь загрузки предыдущей фотографии, прежде чем отправлять новое изображение.

Мы отклоним фото, которые могут показаться сомнительными.

⚠️ Помните, все фотографии модерируются. 

Это значит, что все фотографии проходят одобрение живым человеком (модератором) после предварительного скрининга автоматической системы.

Мы отклоним фото, если обнаружим аналоги в большом количестве на сторонних сайтах в Интернете. Если вы известный человек, загрузите неиспользованную на сторонних сайтах фотографию.
"""

BASE_PROFILE = """✅ Фотография профиля успешно загружена! Вы создали базовую анкету.\n\nХотите просмотреть профиль или перейти к следующему шагу?"""

EXTRA_PHOTOS = """Осталось загрузить 3 актуальные фотографии вашего лица с разного ракурса (анфас и чуть сбоку) для составления вашего личного датасета.

⚠️ Эти фотографии не будут опубликованы в вашем профиле и не будут видны остальным пользователям.

Лучше использовать функцию «сфотографировать» на вашем смартфоне.

Загрузите первую фотографию.
"""

SECOND_PHOTO = """✅ Ваша фотография успешно загружена!

Загрузите вторую фотографию."""

THIRD_PHOTO ="""✅ Ваша фотография успешно загружена!

Загрузите третью фотографию.
"""

ALL_PHOTOS = """Вы загрузили 3 фотографии. Подтвердите загрузку"""

EXTRAS_PHOTOS = """✅ Ваши данные загружены на сервер и проходят модерацию.

Для окончания регистрации вам необходимо загрузить ваши фотографии.

📸 Загрузите основную фотографию вашего профиля.

Можно загружать:
- Качественные и чёткие снимки, где хорошо видно ваше лицо; 
- Подходят «селфи» или портретные фотографии.

Нельзя загружать: 
- Фото в солнцезащитных очках;
- Слишком мелкие фото;
- Фотографии с посторонними людьми;
- Любые другие картинки и изображения.

⚠️ Помните, все фотографии модерируются.
"""

GENDER_CHOOSE = """🟢 Укажите ваш пол и кого вы ищете:"""

CHOSE_GOAL = """🎯 Выберите с какой целью вы ищете новые знакомства"""

CONFIRMING_PHOTO = '''❓Вы действительно хотите установить это фото профиля? Помните фотографии отправляются на модерацию людьми, обмануть систему не получится.'''

CONFIRMING_SIDE_PHOTOS = '''\n\n❓Загрузить фотографии в профиль?'''

START_EDUCATION = """🎉ПОЗДРАВЛЯЕМ ПРОФИЛЬ ЗАКОНЧЕН🎉
Он отправлен на модерацию. 
После короткой проверки мы сообщим о результатах.

Переходим к составлению датасета на основе привлекательности фенотипа. 

Проще говоря, мы определим ваши предпочтения и образ идеального партнёра. 

📷 Надо будет просмотреть и оценить 30 фотографий незнакомых людей противоположного пола.

✳️ Ваша задача — выбрать и оценить тех людей, фотографии которых вызывают у вас положительные эмоции, желание познакомиться и возможно, мечты о совместном будущем.
"""

RULE_STUDING = """✅ Пожалуйста, не спешите, сконцентрируйтесь на внутренних ощущениях, позвольте себе пофантазировать при просмотре фотографий и постарайтесь дать оценку максимально точно.

❇️ Ставьте оценки, основываясь не просто на красоте того или иного человека, а на привлекательности его типа внешности конкретно для вас. 

Вам даётся всего 7 оценок «нравится» и 5 оценок «очень нравится». 

Важно: изображения являются случайными, не входят в перечень фотографий пользователей и используются только для обучения системы. 

⚠️ Обратите внимание! Для корректной работы сервиса ставьте оценку только после того, как полностью загрузится оцениваемая фотография.
"""

SAINT_PETERSBURG = 'Санкт-Петербург'

MOSCOW = 'Москва'

SAMARA = 'Самара'

NOMAD = 'Кочевник'

SERIOUS_REL = 'Серьезные отношения'

FAMILY = 'Создание семьи'

FIRST_NAME = 'Имя'

BIRTHDAY  = 'День рождения'

GENDER = 'Пол'

CITY = 'Город'

REASON = 'Причина поиска отношений'

FAQ_CHOOSE = 'Выберете раздел FAQ.'

ABOUT_MENU = 'Вы можете нажать любую кнопку ниже, и узнать всю необходимую информацию о нашем проекте.'

EDUCTING_MESSAGE = '''Фото %s из 30.
У вас осталось:
- %s оценок «Нравится»
- %s оценок «Очень нравится»'''

FINAL_MESSAGE = """🟢 Ваш профиль сформирован. Мы начинаем поиск по базе и сможем предоставить вам лучшего партнёра, как только обнаружим совпадение. Возможно, на это потребуется некоторое время. 

Ожидайте сообщения от бота. Не выключайте оповещения.

🟢 Если на предыдущем шаге вы не загрузили фото, вернитесь и загрузите фотографии людей, которые являются для вас очень привлекательными."""


SUCCESS_MODERATION = """⭐️ Поздравлем! Модерация прошла успешно и ваш профиль добавлен в систему поиска сервиса знакомств «Unison». 

В ближайшее время вы получите уведомление о совпадении ваших ожиданий с реальным человеком. Система пришлет вам ссылку на профиль. 

Каждую неделю поиск автоматически повторяется. Вы можете пообщаться с человеком, прежде чем встретиться в реальной жизни."""

GAME_ONE = """✨ Внимание! Специальное задание для вас и вашего собеседника. Каждому из вас необходимо отправить поздравительную открытку на адрес: Старая Басманная ул., 36, Москва, 105066. 

Перед отправкой сфотографируйте.

✔️ Доказательство выполнения задания необходимо прислать в этот чат с пометкой #task"""


GAME_TWO = """✨ ✨ Внимание! Специальное задание для вас и вашего собеседника. 

Вам нужно сделать селфи на стоянке с зеленым автомобилем.

✔️ Доказательство выполнения задания необходимо прислать в этот чат с пометкой #task"""

GAME_THREE = """✨ Внимание! Специальное задание для вас и вашего собеседника. 

Покормите голубей и сделайте с ними селфи. Учтите, что нельзя кормить птиц хлебом, лучше всего для этого подойдут сырые семена подсолнуха или крупа.

✔️ Доказательство выполнения задания необходимо прислать в этот чат с пометкой #task"""

GAME_FOUR = """✨ Внимание! Специальное задание для вас и вашего собеседника. 

Купите домой столько туалетной бумаги, сколько сможете унести, сделайте селфи с бумагой.

✔️ Доказательство выполнения задания необходимо прислать в этот чат с пометкой #task"""

GAME_FIVE = """✨ Внимание! Специальное задание для вас и вашего собеседника. 

Начните разделять мусор и покажите, как вы это делаете. Вы можете отправить фото или видео.

✔️ Доказательство выполнения задания необходимо прислать в этот чат с пометкой #tas"""

GAME_SIX = """✨ Внимание! Специальное задание для вас и вашего собеседника. 

Отправьте небольшой благотворительный платёж в любой социальный фонд и сделайте фотографию (скриншот) квитанции.

✔️ Доказательство выполнения задания необходимо прислать в этот чат с пометкой #task"""

GAME_SEVEN = """✨ Внимание! Специальное задание для вас и вашего собеседника. 

Сделайте селфи с книгой, которую сейчас читаете, или с любой другой книгой.

✔️ Доказательство выполнения задания необходимо прислать в этот чат с пометкой #task"""

GAME_EIGHT = """✨ Внимание! Специальное задание для вас и вашего собеседника. 

Измените что-нибудь сильно в своей внешности. Сделайте селфи до и после.

✔️ Доказательство выполнения задания необходимо прислать в этот чат с пометкой #task"""

GAME_NINE = """✨ Внимание! Специальное задание для вас и вашего собеседника. 

Сделайте селфи с чем-то, что относится к вашей профессии.

✔️ Доказательство выполнения задания необходимо прислать в этот чат с пометкой #task"""

GAME_TEN = """✨ Внимание! Специальное задание для вас и вашего собеседника. 

Нарисуйте на листе бумаги то, о чём мечтаете сейчас и обязательно подпишите! 

✔️ Доказательство выполнения задания необходимо прислать в этот чат с пометкой #task"""

GAME_ELEVEN = """✨ Внимание! Специальное задание для вас и вашего собеседника. 

Сделайте бумажного журавлика (инструкция в Интернете по запросу «оригами»). Напишите на нём сегодняшнюю дату и сделайте фотографию. 

✔️ Доказательство выполнения задания необходимо прислать в этот чат с пометкой #task"""

GAME_TWELVE = """✨ Внимание! Специальное задание для вас и вашего собеседника. 

Сделайте бумажного попугая (инструкция в Интернете по запросу «оригами»). Напишите на нём сегодняшнюю дату и сделайте фотографию. 

✔️ Доказательство выполнения задания необходимо прислать в этот чат с пометкой #task"""

WHAT_TO_DO = """Что бы вы хотели сделать?"""

SUBSCRIBE_INFO = """Стоимость месячной подписки составляет 870 рублей.

Оплатите подписку, чтобы мы предоставили вам другой вариант  пары уже через несколько минут.

Далее вы опять сможете отказаться от общения, и мы снова предоставим вам другую пару! И так до тех пор, пока не закончатся все подходящие пары.

В случае нахождения новой, подходящей вам пары, вы сразу же начнёте с ней диалог."""

SUBSCRIBE_ERROR_HAD = """У вас уже имеется активированная подписка на этот месяц. Мы сообщим вам, когда она закончится.

Можно смело продолжать общение."""

PAY_URL = """Для оплаты перейдите, пожалуйста, по данной ссылке:
%s

После оплаты доступ будет открыт в течение 10 минут(обычно 2-3)."""

GET_HELP = """Напишите, пожалуйста, ваш вопрос ниже, мы ответим вам в ближайшее время."""

HELP_MESSAGE = """Пользователь запросил помощь модератора: \n UserID: %s; \n Имя: %s; \n Текст обращения: \n %s\nСсылка на диалог с пользователем:\n https://messenger.smartsender.com/chats?project=unison-dating-bot-72760&selectedContactId=%s"""

OUR_TG = """Подписывайтесь на наш канал в телеграмм, и вы всегда будете в курсе последних событий и обновлений сервиса."""

PAUSE_MAIN_MENU = """Подбор партнёра стоит на паузе.

Вы можете активировать поиск в любой момент, но помните, что новый подбор без оформленной подписки происходит только по понедельникам."""

MAIN_MENU = """Ожидайте подбора партнера!"""

NEW_MATCH = """⭐ Поздравляем! Система определила новую пару именно для вас. 

Ниже в сообщении вы увидите профиль этого пользователя и сможете познакомиться с потенциальной второй половинкой."""

MATCH_INFO = """Имя: %s. \nГород: %s.  \nЦель знакомства: %s."""

FIND_MATCH = """С этого момента и до следующего понедельника вам предоставляется безопасная зона для бесед с выбранным человеком во внутреннем чате сервиса знакомства «Unison». 

Отправляйте сообщения прямо в этом чате, и ваш собеседник их обязательно получит.

☺️ Приятного общения!

Все чаты строго конфиденциальны, мы гарантируем сохранность данных. Система автоматически будет присылать советы по ведению беседы вам и вашей паре. Если вы захотите пригласить собеседника на свидание, достаточно нажать кнопку «Хочу встретиться». В случае согласия собеседника бот предложит вам оптимальные места для встречи.

Если общение вас не устроит, вы в любой момент можете прекратить беседу, нажав кнопку «Завершить диалог». Данный пользователь больше не сможет писать вам сообщения, а система исключит его из списка подходящих партнёров. Новую пару мы подберём вам в течение 5-7 дней."""

END_COMMUNICATION_MESSAGE = """Пожалуйста, укажите причину, по которой вы хотите прекратить общаться с вашим собеседником.

Эта информация не будет доставлена собеседнику. Она требуется для улучшения работы системы."""

UPLOAD_PHOTO_TO_MATCH = """Загрузите, фотографию для отправки вашему собеседнику.

По одной фотографии за раз"""

COMUNICATION_HELP = """Напишите, пожалуйста, суть вашей жалобы.
Мы свяжемся с вами в ближайшее время при необходимости."""

ONE_DAY_TO_UNMATCH = """Внимание!

По нашим правилам ваше время общения с %s истекает завтра в 9:00, и вам будет подобрана новая пара.

Если вам понравилось общение с этим пользователем, то вы можете перейти для общения в личный Телеграмм."""

CALLBACK = """Ваше общение прекращено. 

В течение 2-4 часов вам будет найдена новая пара.

Пожалуйста, ответьте на несколько вопросов для улучшения качества сервиса.

Вам понравился собеседник?"""

CALLBACK_REASON = """Укажите, пожалуйста, причину."""

CALLBACK_MEETING = """Состоялась ли ваша встреча с %s на этой неделе?"""

REASON_MEETING = """Опишите, пожалуйста, причину. Мы примем меры, учтём ваши пожелания и улучшим «Unison». Отзыв будет скрыт от других пользователей."""

ABOUT_MEETING = """Уточните, пожалуйста, что именно не понравилось. Мы учтём замечания и усовершенствуем сервис. Отзыв не будет показываться другим пользователям."""

LIKE_ABOT_MEETING = """Пожалуйста, оцените свидание одной фразой:"""

END_CALLBACK = """Спасибо за ваши ответы. Вы помогаете делать сервис лучше!"""

END_DIALOG = """Ваш диалог с %s завершён.

Мы предложим вам новую пару на следующей неделе. Гарантированный подбор пары проходит только один раз в неделю.

Если вы не хотите ждать, можете воспользоваться платным поиском. Вам будет доступно неограниченное количество подходящих анкет.

Оплатите подписку, и мы сможем предложить вам потенциального партнёра уже через пару минут. В случае вашего отказа от диалога с пользователем, мы продолжим ускоренный поиск до положительного ответа."""

WANNA_MEET = """Спасибо за ваш выбор. Мы сразу сообщим вам, как только собеседник подтвердит желание пойти на свидание."""

SUCCESS_UNSUBSCRIBE = """Подписка успешно отменена"""

USER_LEAVE_CAHT = """⛔️Пользователь покинул чат.⛔️\n Подтвердите прочтение"""
